In [2]:
import pandas as pd
import numpy as np

In [4]:
data=pd.read_csv('train.csv')

In [5]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [6]:
data.head

<bound method NDFrame.head of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

In [7]:
df=pd.DataFrame(data)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [8]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [9]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [11]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [12]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [13]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
df['Survived'].count()

891

# What is the total number of male & female survived?

In [15]:
survived=df[df['Survived']==1]['Survived'].count()
total=df['Survived'].count()
survival_rate=(survived/total)*100
survival_rate

38.38383838383838

In [16]:
no_of_female_survived=df[(df['Sex']=='female')&(df['Survived']==1)]['Survived'].count()
no_of_female_survived

233

In [17]:
no_of_male_survived=df[(df['Sex']=='male')&(df['Survived']==1)]['Survived'].count()
no_of_male_survived

109

In [18]:
per_male=(no_of_male_survived/total)*100
per_male

12.2334455667789

In [19]:
per_female=(no_of_female_survived/total)*100
per_female

26.15039281705948

In [20]:
per_male=(no_of_male_survived/survived)*100
per_male

31.871345029239766

In [21]:
per_female=(no_of_female_survived/survived)*100
per_female

68.12865497076024

In [22]:
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [23]:
no_of_Pclass1=df[(df['Pclass']==1)&(df['Survived']==1)]['Survived'].count()
no_of_Pclass1

136

In [24]:
no_of_Pclass2=df[(df['Pclass']==2)&(df['Survived']==1)]['Survived'].count()
no_of_Pclass2

87

In [25]:
no_of_Pclass3=df[(df['Pclass']==3)&(df['Survived']==1)]['Survived'].count()
no_of_Pclass3

119

In [55]:
per_male=(no_of_male_survived/total)*100
per_male

12.2334455667789

In [56]:
males=df[df['Sex']=='male']['Survived'].count()
total_males=(no_of_male_survived/males)*100
total_males

18.890814558058924

In [57]:
females=df[df['Sex']=='female']['Survived'].count()
total_females=(no_of_female_survived/females)*100
total_females

74.20382165605095

# Is age of people travelling on titanic is normally distributed??

In [58]:
print(df['Age'].mean())

29.69911764705882

In [80]:
df[df['Age']>70].value_counts()

PassengerId  Survived  Pclass  Name                                  Sex   Age   SibSp  Parch  Ticket    Fare     Cabin  Embarked
97           0         1       Goldschmidt, Mr. George B             male  71.0  0      0      PC 17754  34.6542  A5     C           1
631          1         1       Barkworth, Mr. Algernon Henry Wilson  male  80.0  0      0      27042     30.0000  A23    S           1
dtype: int64

In [60]:
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

## no. of male & female survived in different classes.

In [61]:
no_of_male_survived_class1=df[(df['Pclass']==1)&(df['Sex']=='male')&(df['Survived']==1)]['Survived'].count()
no_of_male_survived_class1

45

In [62]:
no_of_male_survived_class2=df[(df['Pclass']==2)&(df['Sex']=='male')&(df['Survived']==1)]['Survived'].count()
no_of_male_survived_class2

17

In [63]:
no_of_male_survived_class3=df[(df['Pclass']==3)&(df['Sex']=='male')&(df['Survived']==1)]['Survived'].count()
no_of_male_survived_class3

47

In [64]:
female_dist_among_Pclass=np.array(df[df['Sex']=='female']['Pclass'].value_counts())
female_dist_among_Pclass

array([144,  94,  76], dtype=int64)

In [65]:
male_dist_among_Pclass=np.array(df[df['Sex']=='male']['Pclass'].value_counts())
male_dist_among_Pclass

array([347, 122, 108], dtype=int64)

In [66]:
no_of_female_survived_class1=df[(df['Pclass']==1)&(df['Sex']=='female')&(df['Survived']==1)]['Survived'].count()
no_of_female_survived_class1

91

In [67]:
age_female_of_Pc1=df[(df['Pclass']==1)&(df['Sex']=='female')&(df['Survived']==1)]['Survived'].count()
print(df['Age'])

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [68]:
no_of_female_survived_class2=df[(df['Pclass']==2)&(df['Sex']=='female')&(df['Survived']==1)]['Survived'].count()
no_of_female_survived_class2

70

In [69]:
no_of_female_survived_class3=df[(df['Pclass']==3)&(df['Sex']=='female')&(df['Survived']==1)]['Survived'].count()
no_of_female_survived_class3

72

In [70]:
print(df['Age'])

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

## Average age of male & female survived in different Pclasses.

In [71]:
age=df.filter(['Age']) 
age_of_female_of_class1=(age[(df['Pclass']==1)&(df['Sex']=='female')&(df['Survived']==1)])
print(age_of_female_of_class1.mean())

Age    34.939024
dtype: float64

In [72]:
age=df.filter(['Age']) 
age_of_female_of_class2=(age[(df['Pclass']==2)&(df['Sex']=='female')&(df['Survived']==1)])
print(age_of_female_of_class2.mean())

Age    28.080882
dtype: float64

In [73]:
age=df.filter(['Age']) 
age_of_female_of_class3=(age[(df['Pclass']==3)&(df['Sex']=='female')&(df['Survived']==1)])
print(age_of_female_of_class3.mean())

Age    19.329787
dtype: float64

In [74]:
age=df.filter(['Age']) 
age_of_male_of_class1=(age[(df['Pclass']==1)&(df['Sex']=='male')&(df['Survived']==1)])
print(age_of_male_of_class1.mean())

Age    36.248
dtype: float64

In [75]:
age=df.filter(['Age']) 
age_of_male_of_class2=(age[(df['Pclass']==2)&(df['Sex']=='male')&(df['Survived']==1)])
print(age_of_male_of_class2.mean())

Age    16.022
dtype: float64

In [76]:
age=df.filter(['Age']) 
age_of_male_of_class3=(age[(df['Pclass']==3)&(df['Sex']=='male')&(df['Survived']==1)])
print(age_of_male_of_class3.mean())

Age    22.274211
dtype: float64

In [95]:
df[df['Age']==3].value_counts()

PassengerId  Survived  Pclass  Name                        Sex   Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
194          1         2       Navratil, Master. Michel M  male  3.0  1      1      230080  26.0  F2     S           1
dtype: int64

In [129]:
SibSp=df.filter(['SibSp']) 
Parch=df.filter(['Parch'])
a=df[df['Age']<10].value_counts() # & df[df['Survived']==1].value_counts()& df[df['Parch']==2].value_counts() & df[df['Sex']=='female'].value_counts()
a

PassengerId  Survived  Pclass  Name                             Sex     Age   SibSp  Parch  Ticket   Fare      Cabin    Embarked
11           1         3       Sandstrom, Miss. Marguerite Rut  female  4.00  1      1      PP 9549  16.7000   G6       S           1
184          1         2       Becker, Master. Richard F        male    1.00  2      1      230136   39.0000   F4       S           1
194          1         2       Navratil, Master. Michel M       male    3.00  1      1      230080   26.0000   F2       S           1
206          0         3       Strom, Miss. Telma Matilda       female  2.00  0      1      347054   10.4625   G6       S           1
298          0         1       Allison, Miss. Helen Loraine     female  2.00  1      2      113781   151.5500  C22 C26  S           1
306          1         1       Allison, Master. Hudson Trevor   male    0.92  1      2      113781   151.5500  C22 C26  S           1
341          1         2       Navratil, Master. Edmond Roger   male    2.00  1      1      230080   26.0000   F2       S           1
446          1         1       Dodge, Master. Washington        male    4.00  0      2      33638    81.8583   A34      S           1
619          1         2       Becker, Miss. Marion Louise      female  4.00  2      1      230136   39.0000   F4       S           1
752          1         3       Moor, Master. Meier              male    6.00  0      1      392096   12.4750   E121     S           1
dtype: int64

In [104]:
df[df['Age']<10].value_counts()

PassengerId  Survived  Pclass  Name                             Sex     Age   SibSp  Parch  Ticket   Fare      Cabin    Embarked
11           1         3       Sandstrom, Miss. Marguerite Rut  female  4.00  1      1      PP 9549  16.7000   G6       S           1
184          1         2       Becker, Master. Richard F        male    1.00  2      1      230136   39.0000   F4       S           1
194          1         2       Navratil, Master. Michel M       male    3.00  1      1      230080   26.0000   F2       S           1
206          0         3       Strom, Miss. Telma Matilda       female  2.00  0      1      347054   10.4625   G6       S           1
298          0         1       Allison, Miss. Helen Loraine     female  2.00  1      2      113781   151.5500  C22 C26  S           1
306          1         1       Allison, Master. Hudson Trevor   male    0.92  1      2      113781   151.5500  C22 C26  S           1
341          1         2       Navratil, Master. Edmond Roger   male    2.00  1      1      230080   26.0000   F2       S           1
446          1         1       Dodge, Master. Washington        male    4.00  0      2      33638    81.8583   A34      S           1
619          1         2       Becker, Miss. Marion Louise      female  4.00  2      1      230136   39.0000   F4       S           1
752          1         3       Moor, Master. Meier              male    6.00  0      1      392096   12.4750   E121     S           1
dtype: int64

In [108]:
no_of_female_survived=df[(df['Sex']=='female')&(df['Survived']==1)&(df['Parch']==1)&(df['Age']<10)]['Survived'].count()
no_of_female_survived

11

In [131]:
age=df.filter(['Ticket']) 
orphan_girl=(age[(df['Survived']==1)&(df['Parch']>0)&(df['Age']<10)])
print(orphan_girl)

              Ticket
10           PP 9549
43     SC/Paris 2123
58        C.A. 34651
78            248738
165           363291
172           347742
183           230136
184           315153
193           230080
233           347077
237       C.A. 31921
261           347077
305           113781
340           230080
348       C.A. 37671
381             2653
407            29106
445            33638
448             2666
469             2666
479          3101298
489       C.A. 37671
530            26360
535     F.C.C. 13529
549       C.A. 33112
618           230136
644             2666
691           349256
720           248727
750            29103
751           392096
755           250649
788        C.A. 2315
803             2625
827  S.C./PARIS 2079
831            29106
869           347742

In [ ]:
age=df.filter(['Ticket']) 
orphan_girl=(age[(df['Survived']==0)&(df['Parch']==2)])
print(orphan_girl)